<a href="https://colab.research.google.com/github/Tusharbhawsar/Feature-Engineering/blob/main/One%20Hot%20Encoding%20/One_Hot_Encoding_Handling_Categorical_Data_.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [21]:
import numpy as np
import pandas as pd

In [22]:
path='/content/drive/MyDrive/excel files/Feature Engeering/One Hot Encoding  Handling Categorical Data /cars.csv'

In [23]:
df=pd.read_csv(path)
df.head()

     brand  km_driven    fuel         owner  selling_price
0   Maruti     145500  Diesel   First Owner         450000
1    Skoda     120000  Diesel  Second Owner         370000
2    Honda     140000  Petrol   Third Owner         158000
3  Hyundai     127000  Diesel   First Owner         225000
4   Maruti     120000  Petrol   First Owner         130000

In [24]:
df['brand'].value_counts()

Maruti           2448
Hyundai          1415
Mahindra          772
Tata              734
Toyota            488
Honda             467
Ford              397
Chevrolet         230
Renault           228
Volkswagen        186
BMW               120
Skoda             105
Nissan             81
Jaguar             71
Volvo              67
Datsun             65
Mercedes-Benz      54
Fiat               47
Audi               40
Lexus              34
Jeep               31
Mitsubishi         14
Land                6
Force               6
Isuzu               5
Kia                 4
Ambassador          4
MG                  3
Daewoo              3
Ashok               1
Peugeot             1
Opel                1
Name: brand, dtype: int64

In [25]:
df['brand'].nunique()

32

In [26]:
df['fuel'].value_counts()

Diesel    4402
Petrol    3631
CNG         57
LPG         38
Name: fuel, dtype: int64

In [27]:
df['owner'].value_counts()

First Owner             5289
Second Owner            2105
Third Owner              555
Fourth & Above Owner     174
Test Drive Car             5
Name: owner, dtype: int64

# One Hot Encoding Using Pandas

In [28]:
pd.get_dummies(df,columns=['fuel','owner'])

        brand  km_driven  ...  owner_Test Drive Car  owner_Third Owner
0      Maruti     145500  ...                     0                  0
1       Skoda     120000  ...                     0                  0
2       Honda     140000  ...                     0                  1
3     Hyundai     127000  ...                     0                  0
4      Maruti     120000  ...                     0                  0
...       ...        ...  ...                   ...                ...
8123  Hyundai     110000  ...                     0                  0
8124  Hyundai     119000  ...                     0                  0
8125   Maruti     120000  ...                     0                  0
8126     Tata      25000  ...                     0                  0
8127     Tata      25000  ...                     0                  0

[8128 rows x 12 columns]

# K-1 One Hot Encoding
Drop first column to solve multicolinerality problem
see below CNG column remove & first owoner column remove 
but we dont use this mathod becoz pandas did'nt save info it gives always new values

In [29]:
pd.get_dummies(df,columns=['fuel','owner'],drop_first=True)

        brand  km_driven  ...  owner_Test Drive Car  owner_Third Owner
0      Maruti     145500  ...                     0                  0
1       Skoda     120000  ...                     0                  0
2       Honda     140000  ...                     0                  1
3     Hyundai     127000  ...                     0                  0
4      Maruti     120000  ...                     0                  0
...       ...        ...  ...                   ...                ...
8123  Hyundai     110000  ...                     0                  0
8124  Hyundai     119000  ...                     0                  0
8125   Maruti     120000  ...                     0                  0
8126     Tata      25000  ...                     0                  0
8127     Tata      25000  ...                     0                  0

[8128 rows x 10 columns]

# One Hot Encoding Using Sklearn

In [30]:
from sklearn.model_selection import train_test_split

In [31]:
x_train,x_test,y_train,y_test=train_test_split(df.iloc[:,0:4],df.iloc[:,-1],test_size=0.2,random_state=0)

In [32]:
x_train.shape

(6502, 4)

In [33]:
x_test.shape

(1626, 4)

In [34]:
from sklearn.preprocessing import OneHotEncoder

In [35]:
from sklearn.preprocessing import OneHotEncoder

In [36]:
ohe=OneHotEncoder(drop='first',sparse=False,dtype=np.int32)

In [37]:
ohe.fit(x_train)

OneHotEncoder(drop='first', dtype=<class 'numpy.int32'>, sparse=False)

In [38]:
x_train.head()

         brand  km_driven    fuel         owner
3042   Hyundai      60000     LPG   First Owner
1520      Tata     150000  Diesel   Third Owner
2611   Hyundai     110000  Diesel  Second Owner
3544  Mahindra      28000  Diesel  Second Owner
4138    Maruti      15000  Petrol   First Owner

In [39]:
x_train_new=ohe.fit_transform(x_train[['fuel','owner']])

In [40]:
x_test_new=ohe.transform(x_test[['fuel','owner']])

In [41]:
x_train_new.shape

(6502, 7)

In [42]:
np.hstack((x_train[['brand',"km_driven"]].values,x_train_new)).shape

(6502, 9)

# One Hot Encoding with Top Categories 
Take only top categories car

In [43]:
df['brand'].value_counts()

Maruti           2448
Hyundai          1415
Mahindra          772
Tata              734
Toyota            488
Honda             467
Ford              397
Chevrolet         230
Renault           228
Volkswagen        186
BMW               120
Skoda             105
Nissan             81
Jaguar             71
Volvo              67
Datsun             65
Mercedes-Benz      54
Fiat               47
Audi               40
Lexus              34
Jeep               31
Mitsubishi         14
Land                6
Force               6
Isuzu               5
Kia                 4
Ambassador          4
MG                  3
Daewoo              3
Ashok               1
Peugeot             1
Opel                1
Name: brand, dtype: int64

In [44]:
count=df['brand'].value_counts()

In [45]:
df['brand'].nunique()
thresehold=100

In [46]:
repl=count[count <=thresehold].index

In [47]:
pd.get_dummies(df['brand'].replace(repl,'uncommon')).sample(5)

      BMW  Chevrolet  Ford  Honda  ...  Tata  Toyota  Volkswagen  uncommon
6042    0          0     0      0  ...     0       1           0         0
5215    0          0     0      0  ...     0       0           0         0
7459    0          0     0      0  ...     0       1           0         0
1583    0          0     0      0  ...     0       0           0         0
6713    0          0     0      0  ...     0       0           0         0

[5 rows x 13 columns]